###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/5f129fcf-eb18-45b9-8cef-bec879e5ebb9/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.project-network.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "project-nat-eip"
        }
      + tags_all             = {
          + "Name" = "project-nat-eip"
        }
      + vpc                  = true
    }

  # module.project-network.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "project-igw"
        }
      + tags_all = {
          + "Name" = "project-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.project-network.aws_nat_gateway.nat_gw will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "project-nat-gw"
        }
      + tags_all                           = {
          + "Name" = "project-nat-gw"
        }
    }

  # module.project-network.aws_route_table.private_subnets_rt will be created
  + resource "aws_route_table" "private_subnets_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "project-private-RT"
        }
      + tags_all         = {
          + "Name" = "project-private-RT"
        }
      + vpc_id           = (known after apply)
    }

  # module.project-network.aws_route_table.public_subnets_rt will be created
  + resource "aws_route_table" "public_subnets_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "project-public-RT"
        }
      + tags_all         = {
          + "Name" = "project-public-RT"
        }
      + vpc_id           = (known after apply)
    }

  # module.project-network.aws_route_table_association.private_rt_association[0] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-network.aws_route_table_association.private_rt_association[1] will be created
  + resource "aws_route_table_association" "private_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-network.aws_route_table_association.public_rt_association[0] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-network.aws_route_table_association.public_rt_association[1] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-network.aws_route_table_association.public_rt_association[2] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-network.aws_route_table_association.public_rt_association[3] will be created
  + resource "aws_route_table_association" "public_rt_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.project-network.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project-private-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "project-private-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-network.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project-private-subnet-2"
        }
      + tags_all                                       = {
          + "Name" = "project-private-subnet-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-network.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project-public-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "project-public-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-network.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project-public-subnet-2"
        }
      + tags_all                                       = {
          + "Name" = "project-public-subnet-2"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-network.aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project-public-subnet-3"
        }
      + tags_all                                       = {
          + "Name" = "project-public-subnet-3"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-network.aws_subnet.public_subnet[3] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "project-public-subnet-4"
        }
      + tags_all                                       = {
          + "Name" = "project-public-subnet-4"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.project-network.aws_vpc.main_vpc will be created
  + resource "aws_vpc" "main_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "project-VPC"
        }
      + tags_all                             = {
          + "Name" = "project-VPC"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id             = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-network.aws_eip.nat_eip will be created%0A  + resource "aws_eip" "nat_eip" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + ptr_record           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name" = "project-nat-eip"%0A        }%0A      + tags_all             = {%0A          + "Name" = "project-nat-eip"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # module.project-network.aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name" = "project-igw"%0A        }%0A      + tags_all = {%0A          + "Name" = "project-igw"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.project-network.aws_nat_gateway.nat_gw will be created%0A  + resource "aws_nat_gateway" "nat_gw" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "Name" = "project-nat-gw"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "project-nat-gw"%0A        }%0A    }%0A%0A  # module.project-network.aws_route_table.private_subnets_rt will be created%0A  + resource "aws_route_table" "private_subnets_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "project-private-RT"%0A        }%0A      + tags_all         = {%0A          + "Name" = "project-private-RT"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table.public_subnets_rt will be created%0A  + resource "aws_route_table" "public_subnets_rt" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "project-public-RT"%0A        }%0A      + tags_all         = {%0A          + "Name" = "project-public-RT"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table_association.private_rt_association[0] will be created%0A  + resource "aws_route_table_association" "private_rt_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table_association.private_rt_association[1] will be created%0A  + resource "aws_route_table_association" "private_rt_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table_association.public_rt_association[0] will be created%0A  + resource "aws_route_table_association" "public_rt_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table_association.public_rt_association[1] will be created%0A  + resource "aws_route_table_association" "public_rt_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table_association.public_rt_association[2] will be created%0A  + resource "aws_route_table_association" "public_rt_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.project-network.aws_route_table_association.public_rt_association[3] will be created%0A  + resource "aws_route_table_association" "public_rt_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.project-network.aws_subnet.private_subnet[0] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "project-private-subnet-1"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "project-private-subnet-1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.project-network.aws_subnet.private_subnet[1] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "project-private-subnet-2"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "project-private-subnet-2"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.project-network.aws_subnet.public_subnet[0] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "project-public-subnet-1"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "project-public-subnet-1"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.project-network.aws_subnet.public_subnet[1] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "project-public-subnet-2"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "project-public-subnet-2"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.project-network.aws_subnet.public_subnet[2] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "project-public-subnet-3"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "project-public-subnet-3"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.project-network.aws_subnet.public_subnet[3] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "project-public-subnet-4"%0A        }%0A      + tags_all                                       = {%0A          + "Name" = "project-public-subnet-4"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.project-network.aws_vpc.main_vpc will be created%0A  + resource "aws_vpc" "main_vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.1.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name" = "project-VPC"%0A        }%0A      + tags_all                             = {%0A          + "Name" = "project-VPC"%0A        }%0A    }%0A%0APlan: 18 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + private_subnet_ids = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + public_subnet_ids  = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_id             = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @KusalThiwanka, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deploy`*